#Реализовать сортировку списка методом пузырька.
n=6
a=[4,12,7,11,8,22]
print(f'Cписок {a}')
for c in range(n-1):
    for i in range(n-1-c):
        if a[i]>a[i+1]:
            a[i],a[i+1] = a[i+1],a[i]
print(f'Отсортированый список {a}')


    